{"format": "layers-model", "generatedBy": null, "convertedBy": "TensorFlow.js Converter v1.2.10.1", "modelTopology": null, "weightsManifest": [{"paths": ["group1-shard1of2.bin", "group1-shard2of2.bin"], "weights": [{"name": "embedding_2/embeddings", "shape": [2400, 300], "dtype": "float32"}, {"name": "lstm_2/kernel", "shape": [300, 512], "dtype": "float32"}, {"name": "lstm_2/recurrent_kernel", "shape": [128, 512], "dtype": "float32"}, {"name": "lstm_2/bias", "shape": [512], "dtype": "float32"}, {"name": "dense_1/kernel", "shape": [128, 128], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [128], "dtype": "float32"}, {"name": "dense_2/kernel", "shape": [128, 2400], "dtype": "float32"}, {"name": "dense_2/bias", "shape": [2400], "dtype": "float32"}]}]}